import { defineConfig } from 'vitepress'
import markdownItKatex from 'markdown-it-katex'
// https://vitepress.dev/reference/site-config
export default defineConfig({
	title: 'Jachin Personal Blog',
	description: 'Jachin Personal Blog',
	lang: 'zh-CN',
	lastUpdated: true,
	search: {
		provider: 'local',
	},
	themeConfig: {
		outline: [1, 6], // 只显示 h2 和 h3 标题
		// https://vitepress.dev/reference/default-theme-config
		nav: [
			{ text: 'Home', link: '/' },
			// { text: 'Examples', link: '/markdown-examples' },
			{ text: '总览', link: '/总结/思维导图/总览' },
			{ text: '申论', link: '/申论/申论' },
			{ text: '行测', link: '/行测/行测' },

			{
				text: '综合应用',
				link: '/综合应用/各名师总结',
			},
		],
		sidebar: {
			'/申论/': [
				{
					text: '国考',
					collapsed: true,
					items: [
						{
							text: '2025行政执法',
							link: '/申论/国考/2025年国考《申论》行政执法（预计 2025 年 11 月更新视频讲解）',
						},
						{
							text: '2025副省级',
							link: '/申论/国考/2025年国考《申论》副省级（预计 2025 年 11 月更新视频讲解）',
						},
						{
							text: '2025地市级',
							link: '/申论/国考/2025年国考《申论》地市级（预计 2025 年 11 月更新视频讲解）',
						},

						{ text: '2024行政执法', link: '/申论/国考/2024年国考《申论》行政执法' },
						{ text: '2024副省级国考', link: '/申论/国考/2024年国考《申论》副省级' },
						{ text: '2024地市级国考', link: '/申论/国考/2024年国考《申论》地市级' },

						{ text: '2023行政执法国考', link: '/申论/国考/2023年国考《申论》（行政执法）' },
						{ text: '2023副省级国考', link: '/申论/国考/2023年国考《申论》（副省级）' },
						{ text: '2023地市级国考', link: '/申论/国考/2023年国考《申论》（地市级）' },

						{ text: '2022地市级国考', link: '/申论/国考/2022年国家《申论》（地市级）' },

						{ text: '2021地市级国考', link: '/申论/国考/2021年国考《申论》（地市级）' },

						{ text: '2020地市级国考', link: '/申论/国考/2020年国考《申论》（地市级）' },

						{ text: '2019地市级国考', link: '/申论/国考/2019年国考《申论》（地市级）' },

						{ text: '2018年国考', link: '/申论/国考/2018年国考《申论》' },

						{ text: '2017年国考', link: '/申论/国考/2017年国考《申论》' },

						{ text: '2016年国考', link: '/申论/国考/2016年国考《申论》地市级' },

						{ text: '2015年国考', link: '/申论/国考/2015年国考《申论》' },

						{ text: '2014年国考', link: '/申论/国考/2014年国考《申论》' },
					],
				},
				{
					text: '省考/联考',
					collapsed: true,
					items: [
						{
							text: '2024年多省联考《申论》（湖南省市 卷）（网友回忆版）',
							link: '/申论/多省联考/2024年多省联考《申论》（湖南省市 卷）（网友回忆版）.md',
						},
						{
							text: '2024年多省联考《申论》（湖北县乡 卷）（网友回忆版）',
							link: '/申论/多省联考/2024年多省联考《申论》（湖北县乡 卷）（网友回忆版）.md',
						},
						{
							text: '2024年多省联考《申论》（黑龙江行政 执法卷）（网友回忆版）',
							link: '/申论/多省联考/2024年多省联考《申论》（黑龙江行政 执法卷）（网友回忆版）.md',
						},
						{
							text: '2024年多省联考《申论》（河南县级 卷）（网友回忆版）',
							link: '/申论/多省联考/2024年多省联考《申论》（河南县级 卷）（网友回忆版）.md',
						},
						{
							text: '2024年多省联考《申论》（河北 B 卷）（网友回忆版）',
							link: '/申论/多省联考/2024年多省联考《申论》（河北 B 卷）（网友回忆版）.md',
						},
						{
							text: '2024年多省联考《申论》（安徽 A 卷）（网友回忆版）',
							link: '/申论/多省联考/2024年多省联考《申论》（安徽 A 卷）（网友回忆版）.md',
						},
						{
							text: '2023年多省联考申论（云南县乡卷）',
							link: '/申论/多省联考/2023年多省联考申论（云南县乡卷）.md',
						},
						{
							text: '2023年多省联考申论（辽宁 A 卷）',
							link: '/申论/多省联考/2023年多省联考申论（辽宁 A 卷）.md',
						},
						{
							text: '2023年多省联考申论（湖南省市卷）',
							link: '/申论/多省联考/2023年多省联考申论（湖南省市卷）.md',
						},
						{
							text: '2023年多省联考申论（湖北县乡卷）',
							link: '/申论/多省联考/2023年多省联考申论（湖北县乡卷）.md',
						},
						{
							text: '2023年多省联考申论（河南市级卷）',
							link: '/申论/多省联考/2023年多省联考申论（河南市级卷）.md',
						},
						{
							text: '2023年多省联考申论（河北 A 卷）',
							link: '/申论/多省联考/2023年多省联考申论（河北 A 卷）.md',
						},
						{
							text: '2023年多省联考申论（安徽 C 卷）',
							link: '/申论/多省联考/2023年多省联考申论（安徽 C 卷）.md',
						},
						{
							text: '2022年多省联考申论江西行政执法卷',
							link: '/申论/多省联考/2022年多省联考申论江西行政执法卷.md',
						},
						{
							text: '2022年多省联考申论湖北省市卷',
							link: '/申论/多省联考/2022年多省联考申论湖北省市卷.md',
						},
						{
							text: '2022年多省联考申论河南县级卷',
							link: '/申论/多省联考/2022年多省联考申论河南县级卷.md',
						},
						{
							text: '2022年多省联考申论河北乡镇卷',
							link: '/申论/多省联考/2022年多省联考申论河北乡镇卷.md',
						},
						{
							text: '2022年多省联考申论安徽 C 执法卷',
							link: '/申论/多省联考/2022年多省联考申论安徽 C 执法卷.md',
						},
						{
							text: '2022年多省联考申论（湖南县乡卷）',
							link: '/申论/多省联考/2022年多省联考申论（湖南县乡卷）.md',
						},
						{
							text: '2021年联考申论湖南行政执法',
							link: '/申论/多省联考/2021年联考申论湖南行政执法.md',
						},
						{
							text: '2021年联考吉林申论',
							link: '/申论/多省联考/2021年联考吉林申论.md',
						},
						{
							text: '2021年多省联考申论安徽 B 卷',
							link: '/申论/多省联考/2021年多省联考申论安徽 B 卷.md',
						},
						{
							text: '2021年多省联考申论（江西省市县 卷）',
							link: '/申论/多省联考/2021年多省联考申论（江西省市县 卷）.md',
						},
						{
							text: '2021年多省联考申论（河南乡镇卷）',
							link: '/申论/多省联考/2021年多省联考申论（河南乡镇卷）.md',
						},
						{
							text: '2020年联考（乡镇卷）申论',
							link: '/申论/多省联考/2020年联考（乡镇卷）申论.md',
						},
						{
							text: '2020年0822 多省联考《申论》（安徽 C 卷）',
							link: '/申论/多省联考/2020年0822 多省联考《申论》（安徽 C 卷）.md',
						},
						{
							text: '2020年0822 多省联考《申论》（安徽 B 卷）',
							link: '/申论/多省联考/2020年0822 多省联考《申论》（安徽 B 卷）.md',
						},
						{
							text: '2020年0822 多省联考《申论》（安徽 A 卷）',
							link: '/申论/多省联考/2020年0822 多省联考《申论》（安徽 A 卷）.md',
						},
						{
							text: '2020年0725多省联考《申论》（福建 县级卷）',
							link: '/申论/多省联考/2020年0725多省联考《申论》（福建 县级卷）.md',
						},
						{
							text: '2020年0725 多省联考《申论》（福建 乡镇卷）',
							link: '/申论/多省联考/2020年0725 多省联考《申论》（福建 乡镇卷）.md',
						},
						{
							text: '2019年联考（县级卷）申论',
							link: '/申论/多省联考/2019年联考（县级卷）申论.md',
						},
						{
							text: '2019年多省联考江西申论（县级）',
							link: '/申论/多省联考/2019年多省联考江西申论（县级）.md',
						},
						{
							text: '2018年联考（全国通用）申论',
							link: '/申论/多省联考/2018年联考（全国通用）申论.md',
						},
						{
							text: '2017年联考（通用卷）申论',
							link: '/申论/多省联考/2017年联考（通用卷）申论.md',
						},
						{
							text: '2017年多省联考江西申论',
							link: '/申论/多省联考/2017年多省联考江西申论.md',
						},
					],
				},
			],
			'/行测/': [
				{
					text: '政治/常识',
					collapsed: false,
					items: [],
				},
				{
					text: '判断推理',
					collapsed: false,
					items: [
						{
							text: '花生十三',
							collapsed: true,
							items: [
								{
									text: '总结',
									collapsed: false,
									items: [
										{ text: '判断推理', link: '/总结/花生十三总结/花生判断笔记总结' },
										{ text: '图形推理', link: '/总结/花生十三总结/花生图形推理笔记' },
										{ text: '图推类比总结20250809', link: '/行测/判断推理/图推类比总结20250809' },
									],
								},
								{
									text: '讲题',
									collapsed: false,
									items: [
										{ text: '判断20250714', link: '/行测/判断推理/判断20250714' },
										{ text: '判断20250715', link: '/行测/判断推理/判断20250715' },
										{ text: '判断20250716', link: '/行测/判断推理/判断20250716' },
										{ text: '判断20250717', link: '/行测/判断推理/判断20250717' },
										{ text: '判断20250718', link: '/行测/判断推理/判断20250718' },

										{ text: '判断20250720', link: '/行测/判断推理/判断20250720' },
										{ text: '判断20250721', link: '/行测/判断推理/判断20250721' },
										{ text: '判断20250722', link: '/行测/判断推理/判断20250722' },
										{ text: '判断20250723', link: '/行测/判断推理/判断20250723' },
										{ text: '判断20250724', link: '/行测/判断推理/判断20250724' },

										{ text: '判断20250726', link: '/行测/判断推理/判断20250726' },
										{ text: '判断20250803', link: '/行测/判断推理/判断20250803' },
										{ text: '判断20250804', link: '/行测/判断推理/判断20250804' },
									],
								},
								{
									text: '刷题',
									collapsed: false,
									items: [
										{ text: '判断刷题20250731', link: '/行测/判断推理/判断刷题20250731' },
										{ text: '判断刷题20250803', link: '/行测/判断推理/判断刷题20250803' },
										{ text: '判断刷题20250804', link: '/行测/判断推理/判断刷题20250804' },
										{ text: '判断刷题20250805', link: '/行测/判断推理/判断刷题20250805' },
										{ text: '判断刷题20250807', link: '/行测/判断推理/判断刷题20250807' },
										{ text: '判断刷题20250808', link: '/行测/判断推理/判断刷题20250808' },
										{ text: '判断刷题20250810', link: '/行测/判断推理/判断刷题20250810' },
									],
								},
								{
									text: '图推',
									collapsed: false,
									items: [
										{ text: '图推20250728', link: '/行测/判断推理/图推20250728' },
										{ text: '图推20250729', link: '/行测/判断推理/图推20250729' },
										{ text: '图推20250730', link: '/行测/判断推理/图推20250730' },
										{ text: '图推20250731', link: '/行测/判断推理/图推20250731' },
										{ text: '图推20250804', link: '/行测/判断推理/图推20250804' },
									],
								},
								{
									text: '定义',
									collapsed: false,
									items: [
										{ text: '定义20250805', link: '/行测/判断推理/定义20250805' },
										{ text: '定义20250806', link: '/行测/判断推理/定义20250806' },
									],
								},
								{ text: '类比20250807', link: '/行测/判断推理/类比20250807' },
							],
						},
					],
				},
				{
					text: '资料分析',
					collapsed: false,
					items: [
						{
							text: '花生十三',
							collapsed: true,
							items: [
								{
									text: '总结',
									collapsed: false,
									items: [{ text: '资料分析', link: '/总结/花生十三总结/花生资料分析笔记' }],
								},
								{
									text: '讲题',
									collapsed: false,
									items: [
										{ text: '资料20250703', link: '/行测/资料分析/资料20250703' },
										{ text: '资料20250704', link: '/行测/资料分析/资料20250704' },
										{ text: '资料20250705', link: '/行测/资料分析/资料20250705' },
										{ text: '资料20250707', link: '/行测/资料分析/资料20250707' },
										{ text: '资料20250708', link: '/行测/资料分析/资料20250708' },
										{ text: '资料20250709', link: '/行测/资料分析/资料20250709' },
										{ text: '资料20250710', link: '/行测/资料分析/资料20250710' },
										{ text: '资料20250712', link: '/行测/资料分析/资料20250712' },
										{ text: '资料20250713', link: '/行测/资料分析/资料20250713' },
										{ text: '资料20250716', link: '/行测/资料分析/资料20250716' },
										{ text: '资料20250719', link: '/行测/资料分析/资料20250719' },
										{ text: '资料20250727', link: '/行测/资料分析/资料20250727' },
									],
								},
								{
									text: '刷题',
									collapsed: false,
									items: [
										{ text: '资料刷题20250717', link: '/行测/资料分析/资料刷题20250717' },
										{ text: '资料刷题20250718', link: '/行测/资料分析/资料刷题20250718' },
										{ text: '资料刷题20250721', link: '/行测/资料分析/资料刷题20250721' },
										{ text: '资料刷题20250722', link: '/行测/资料分析/资料刷题20250722' },
										{ text: '资料刷题20250724', link: '/行测/资料分析/资料刷题20250724' },
									],
								},
							],
						},
						{
							text: '白天老师',
							collapsed: true,
							items: [
								{ text: '2、加减法速算', link: '/行测/白天老师资料分析/2、加减法速算' },
								{ text: '3、乘除法速算', link: '/行测/白天老师资料分析/3、乘除法速算' },
								{ text: '4、数量级思维', link: '/行测/白天老师资料分析/4、数量级思维' },
								{ text: '5、百化分思维', link: '/行测/白天老师资料分析/5、百化分思维' },
								{ text: '6、修整思维', link: '/行测/白天老师资料分析/6、修整思维' },
								{ text: '7、分数比较', link: '/行测/白天老师资料分析/7、分数比较' },
								{ text: '8、速算技巧总结', link: '/行测/白天老师资料分析/8、速算技巧总结' },
								{ text: '9、基础概念', link: '/行测/白天老师资料分析/9、基础概念' },
								{ text: '10、增长率', link: '/行测/白天老师资料分析/10、增长率' },
								{ text: '11、基期量', link: '/行测/白天老师资料分析/11、基期量' },
								{ text: '12、增长量年均增长量', link: '/行测/白天老师资料分析/12、增长量年均增长量' },
								{ text: '13、现期量', link: '/行测/白天老师资料分析/13、现期量' },
								{ text: '14、增长相关总结', link: '/行测/白天老师资料分析/14、增长相关总结' },
								{ text: '15、现期比重', link: '/行测/白天老师资料分析/15、现期比重' },
								{ text: '16、基期比重', link: '/行测/白天老师资料分析/16、基期比重' },
								{ text: '17、两期比重', link: '/行测/白天老师资料分析/17、两期比重' },
								{ text: '18、平均数相关', link: '/行测/白天老师资料分析/18、平均数相关' },
								{ text: '19、倍数相关', link: '/行测/白天老师资料分析/19、倍数相关' },
								{ text: '20、比值相关总结', link: '/行测/白天老师资料分析/20、比值相关总结' },
								{ text: '21、间隔增长率', link: '/行测/白天老师资料分析/21、间隔增长率' },
								{ text: '22、年均增长率', link: '/行测/白天老师资料分析/22、年均增长率' },
								{ text: '23、混合增长率', link: '/行测/白天老师资料分析/23、混合增长率' },
								{ text: '24、平均数增长率', link: '/行测/白天老师资料分析/24、平均数增长率' },
								{ text: '25、乘积增长率', link: '/行测/白天老师资料分析/25、乘积增长率' },
								{ text: '26、增长率相关总结课', link: '/行测/白天老师资料分析/26、增长率相关总结课' },
								{ text: '27、增长率大小比较', link: '/行测/白天老师资料分析/27、增长率大小比较' },
								{ text: '28、基期量大小比较', link: '/行测/白天老师资料分析/28、基期量大小比较' },
								{ text: '29、增长量大小比较', link: '/行测/白天老师资料分析/29、增长量大小比较' },
								{
									text: '30、比重平均数大小比较',
									link: '/行测/白天老师资料分析/30、比重平均数大小比较',
								},
								{ text: '31、比较相关总结', link: '/行测/白天老师资料分析/31、比较相关总结' },
								{ text: '32、分数比较速算补充', link: '/行测/白天老师资料分析/32、分数比较速算补充' },
								{ text: '33、十字交叉与线段法', link: '/行测/白天老师资料分析/33、十字交叉与线段法' },
								{
									text: '34、名义增长率与实际增长率',
									link: '/行测/白天老师资料分析/34、名义增长率与实际增长率',
								},
								{
									text: '35、拉动增长率与增长贡献率',
									link: '/行测/白天老师资料分析/35、拉动增长率与增长贡献率',
								},
								{ text: '36、容斥与最值', link: '/行测/白天老师资料分析/36、容斥与最值' },
								{ text: '37、间隔增长率拔高', link: '/行测/白天老师资料分析/37、间隔增长率拔高' },
								{ text: '1、增长率刷题', link: '/行测/白天老师资料分析/刷题/1、增长率刷题' },
								{ text: '2、基期量刷题', link: '/行测/白天老师资料分析/刷题/2、基期量刷题' },
								{ text: '3、增长量刷题', link: '/行测/白天老师资料分析/刷题/3、增长量刷题' },
								{ text: '4、年均增长量刷题', link: '/行测/白天老师资料分析/刷题/4、年均增长量刷题' },
								{ text: '5、现期量刷题', link: '/行测/白天老师资料分析/刷题/5、现期量刷题' },
								{ text: '6、现期比重刷题', link: '/行测/白天老师资料分析/刷题/6、现期比重刷题' },
								{ text: '7、基期比重刷题', link: '/行测/白天老师资料分析/刷题/7、基期比重刷题' },
								{ text: '8、两期比重刷题', link: '/行测/白天老师资料分析/刷题/8、两期比重刷题' },
								{ text: '9、平均数相关刷题', link: '/行测/白天老师资料分析/刷题/9、平均数相关刷题' },
								{ text: '10、倍数相关刷题', link: '/行测/白天老师资料分析/刷题/10、倍数相关刷题' },
								{ text: '11、间隔增长率刷题', link: '/行测/白天老师资料分析/刷题/11、间隔增长率刷题' },
								{ text: '12、年均增长率刷题', link: '/行测/白天老师资料分析/刷题/12、年均增长率刷题' },
								{ text: '13、混合增长率刷题', link: '/行测/白天老师资料分析/刷题/13、混合增长率刷题' },
								{
									text: '14、平均数增长率刷题',
									link: '/行测/白天老师资料分析/刷题/14、平均数增长率刷题',
								},
								{ text: '15、乘积增长率刷题', link: '/行测/白天老师资料分析/刷题/15、乘积增长率刷题' },
								{ text: '16、增长率比较刷题', link: '/行测/白天老师资料分析/刷题/16、增长率比较刷题' },
								{ text: '17、基期量比较刷题', link: '/行测/白天老师资料分析/刷题/17、基期量比较刷题' },
								{ text: '18、增长量比较刷题', link: '/行测/白天老师资料分析/刷题/18、增长量比较刷题' },
							],
						},
					],
				},
				{
					text: '数量关系',
					collapsed: false,
					items: [
						{
							text: '花生十三',
							collapsed: true,
							items: [{ text: '数量关系', link: '/总结/花生十三总结/花生数量关系笔记' }],
						},
					],
				},
				{
					text: '言语理解',
					collapsed: false,
					items: [
						{
							text: '花生十三',
							collapsed: true,
							items: [{ text: '言语理解', link: '/总结/花生十三总结/花生言语理解笔记' }],
						},
					],
				},
			],

			'/综合应用/': [
				{
					text: '综合应用',
					collapsed: false,
					items: [
						{ text: '各名师总结', link: '/综合应用/各名师总结' },
						{ text: '天晓综应A', link: '/综合应用/天晓综应A' },
						{ text: '规范词表达', link: '/综合应用/规范词表达' },
					],
				},
			],
			'/总结/': [
				{
					text: '思维导图',
					items: [
						{ text: '总览', link: '/总结/思维导图/总览' },
						{ text: '言语理解', link: '/总结/思维导图/言语理解' },
						{ text: '判断推理', link: '/总结/思维导图/判断推理' },
						{ text: '资料分析', link: '/总结/思维导图/资料分析' },
					],
				},
				{
					text: '花生十三',
					collapsed: false,
					items: [
						{ text: '判断推理', link: '/总结/花生十三总结/花生判断笔记总结' },
						{ text: '图形推理', link: '/总结/花生十三总结/花生图形推理笔记' },
						{ text: '资料分析', link: '/总结/花生十三总结/花生资料分析笔记' },
						{ text: '数量关系', link: '/总结/花生十三总结/花生数量关系笔记' },
						{ text: '言语理解', link: '/总结/花生十三总结/花生言语理解笔记' },
					],
				},
			],
		},

		socialLinks: [{ icon: 'github', link: 'https://github.com/Jachin-Luo/vitePressTest' }],
	},
	markdown: {
		image: {
			// 默认禁用；设置为 true 可为所有图片启用懒加载。
			lazyLoading: true,
		},
		config: (md) => {
			md.use(markdownItKatex)
		},
		head: [
			[
				'link',
				{
					rel: 'stylesheet',
					href: 'https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/katex.min.css',
				},
			],
		],
		// math: true,
		// 注册 markdown-it 插件
	},
})
